common/models/Setting.php

SELECT `id`, `parent_id`, `code`, `type`, `value` FROM `tb_setting` WHERE parent_id=61
---
    public function getContact(){
        $list = $this::find()->select("id, parent_id, code, type, value")->where("parent_id=" . $this->CONTACT_ID)->asArray()->all();

SELECT `id`, `parent_id`, `code`, `type`, `value` FROM `tb_setting` WHERE parent_id=11
---
    public function getSiteBasic(){
        $list = $this::find()->select("id, parent_id, code, type, value")->where("parent_id=" . $this->SITE_BASIC_ID)->asArray()->all();