common/models/SystemCategory.php

    public function getInfo($id){
        return $this::find()->where("id=:id",[':id'=>$id])->one();
---
SELECT * FROM `tb_system_category` WHERE id=1