common/models/SystemProduct.php

SELECT * FROM `tb_system_product` WHERE id='2'
---
    public function getInfo($id){
        return $this::find()->where("id=:id",[':id'=>$id])->one();