frontend/modules/web/models/SystemBannerWeb.php

    public function getList(){
        $list = $this->find()->where("is_del=:is_del AND is_show=:is_show",[":is_del"=>  \common\helpers\Models::IS_DEL_NO, ":is_show"=>  \common\helpers\Models::IS_SHOW_YES])->orderBy("sort ASC, id DESC")->asArray()->all();
---
SELECT * FROM `tb_system_banner` WHERE is_del=0 AND is_show=1 ORDER BY `sort`, `id` DESC