frontend/modules/web/models/SystemProductWeb.php

    public function getNextArticle($articleId, $categoryId){
        $info = $this->find()->where("id>:id AND category_id=:category_id AND is_del=:is_del AND is_show=:is_show",
                       [":id"=>$articleId, ":category_id"=>$categoryId, ":is_del"=>Models::IS_DEL_NO, ":is_show"=>Models::IS_SHOW_YES])->orderBy("id ASC")->asArray()->one();
---
SELECT * FROM `tb_system_product` WHERE id>2 AND category_id=1 AND is_del=0 AND is_show=1 ORDER BY `id`

    public function getLastArticle($articleId, $categoryId){
        $info = $this->find()->where("id<:id AND category_id=:category_id AND is_del=:is_del AND is_show=:is_show",
                       [":id"=>$articleId, ":category_id"=>$categoryId, ":is_del"=>Models::IS_DEL_NO, ":is_show"=>Models::IS_SHOW_YES])->orderBy("id DESC")->asArray()->one();
---
SELECT * FROM `tb_system_product` WHERE id<2 AND category_id=1 AND is_del=0 AND is_show=1 ORDER BY `id` DESC